#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//操作符和表达式
//1.各种操作符的介绍
//2.表达式求值

//操纵符分类：算术操作符、移位操作符、位操作符、赋值操作符、单目操作符、关系操作符、
//            逻辑操作符、条件操作符、逗号表达式、下标引用、函数调用和结构成员


//算数操作符
//  +  -  *  /  %
//1.除了%操作符之外，其他几个操作符可以作用于整数和浮点数
//2.对于/操作符，如果两个操作数都为整数，执行整数除法.而只要有浮点数执行的就是浮点数除法
//3.%操作符的两个操作数必须为整数，返回的是整除之后的余数
int main()
{
	int a = 5 / 2;  //商2余1
	printf("a = %d\n", a);
	int b = 5 % 2;
	printf("b = %d\n", b);
	double c = 5 / 2.0;  //浮点类型
	printf("c = %lf\n", c);

	double d = 5 % 2; //取模运算等号两边必须是同一类型，不能出现左边整数右边小数
	printf("d = %lf\n", d);
	return 0;
}


//移位操作符
// <<左移操作符  >>右移操作符

//  右移操作符：1.算术右移  2.逻辑右移
//  算术右移：右边丢弃，左边补原符号位   逻辑移位：右边丢弃，左边补0
int main()
{
	int a = 16;
	int b = a >> 1;  //右移一位
	//>> -- 右移操作符，移动的是二进制位
	//a = 00000000000000000000000000010000
	printf("%d\n", b);

	int c = -1;
	//整数的二进制表示有：原码,反码,补码
	//存储到内存的是补码
	//10000000000000000000000000000001 - 原码
	//11111111111111111111111111111110 - 反码  符号位不变，其他位按位取反
	//11111111111111111111111111111111 - 补码 - 整数的补码=原码  负数的补码[x]补 = [x]反+1
	int d = c >> 2;
	printf("%d\n", c);
	//所以c = -1 存放是补码，当右移时符号位不变，其他位依然是1
	return 0;
}

//左移操作符:左边丢弃，右边补0  有乘2的效果
int main()
{
	int a = -5;
	int b = a << 1;
	//00000000000000000000000000000101
	printf("%d\n", b);
	return 0;
}

//ps：对于移位运算符，不要移动负数位，这个是标准未定义的
//例如：
int num = 10;
num >> -1; //error